#  Home work
# 17.03.2023
# 1. Сформуйте стрінг, в якому міститься інформація про певне слово.
# "Word [тут слово] has [тут довжина слова, отримайте з самого сдлва] letters",
# наприклад "Word 'Python' has 6 letters".
# Для отримання слова для аналізу скористайтеся константою або функцією input().

# my_word = input("Pls, enter the word: ")
# print(f'Word {my_word} has {len(my_word)} letters')

# 2. Напишіть программу "Касир в кінотеватрі", яка попросіть користувача ввести свсвій вік
# (можно використати константу або функцію input(), на екран має бути виведено лише одне повідомлення,
# також подумайте над варіантами, коли введені невірні дані).
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
# якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"
# якщо вік користувача містить цифру 7 - вивести повідомлення "Вам сьогодні пощастить!"
# у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"



cashier = input("Скільки Вам років? ")

if cashier.isdigit():
    other_cashier = int(cashier)
    if other_cashier < 7:
        print("Де твої батьки?")

    elif other_cashier < 16:
        print("Це фільм для дорослих!")

    elif other_cashier > 65:
        print("Покажіть пенсійне посвідчення!")

    elif "7" in cashier:
        print("Вам сьогодні пощастить!")

    else:
        print("А білетів вже немає!")
else: print("Ви ввели щось не те!")


